#####################Begin#####################################
# 要求输出成绩等级A、B、C、D、E，其中90~100分为A，80~89分为B，70~79分为C，60~69分为D，60分以下为E。
num = eval(input('请输入成绩：'))
# 要求：
# 用if-elif-else语句实现；
# 输入百分制成绩后要判断该成绩的合理性（num<0 or num>100 or num%1!=0），对不合理的成绩应输出出错信息（"您输入的成绩不合理，请检查后重新输入"）。
if num < 0 or num > 100 or num % 1 != 0:
    print("您输入的成绩不合理，请检查后重新输入")
elif num >= 90:
    print("A")
elif num >= 80:
    print("B")
elif num >= 70:
    print("C")
elif num >= 60:
    print("D")
else:
    print("E")


#####################End#####################################
